app/controllers/entries_controller.rb

SELECT * FROM `entries` ORDER BY created_at desc
---
  def index
    @blog = Blog.find(params[:blog_id])
    @entries = Entry.where(:blog_id => @blog.id).order('entries.id DESC')
    respond_to do |format|
      format.html { @entries = @entries.page(params[:page]) }

SELECT * FROM `entries` WHERE (`entries`.`id` = 442820205)
---
  def show
    @entry = Entry.includes(:blog, :comments, :tags)
                  .references(:blog, :comments, :tags)
                  .find(params[:id])

SELECT * FROM `entries` WHERE (`entries`.`id` = 442820205)
---
  def edit
    @entry = Entry.find(params[:id])

INSERT INTO `entries` (`updated_at`, `title`, `body`, `author`, `excerpt`, `created_at`) VALUES('2009-05-11 17:59:47', 'Wichtige Informationen', 'Was ist die Wahrheit?', 'pg', 'Lügen haben kurze Beine.', '2009-05-11 17:59:47')
---
  def create
    if params[:entry] && params[:entry][:blog_id].present?
      @blog = Blog.find(params[:entry][:blog_id])
    end

    params[:entry].delete(:blog_id)

    @entry = Entry.new(params[:entry])
    @entry.author = @author
    @entry.blog = @blog

    respond_to do |format|
      if params[:commit] == "Vorschau"
        @entry.regenerate_html
        @preview = true
        format.html { render :action => "edit" }
      else
        if @entry.save